package com.btc.global.json.enums;


public enum RspCodeEnum {
	
	/**成功*/
	SUCCESS("0000","成功"),
	
	/**用户未登录*/
	$0001("0001","用户未登录"),
	
	/**服务器繁忙*/
	$0002("0002","服务器繁忙"),
	
	/**参数不正确*/
	$0003("0003","参数不正确"),
	
	/**非法操作*/
	$0004("0004","非法操作"),
	
	/**请勿重复操作*/
	$0005("0005","请勿重复操作"),
	
	/**系统正在维护中，请稍后重试*/
	$0006("0006","系统正在维护中，请稍后重试"),
	
	
	/**为设置响应码*/
	
	//################################################1100-1200文件上传相关####################################
	$1101("1101","图片类型不合法"),
	//################################################2100-2300用户信息###########################
	
	/**用户名已存在*/
	$2100("2100","用户名已存在"),
	/**权限不足*/
	$2101("2101","权限不足"),
	
	//################################################2300-2500货币信息###########################

	/**货币名称已存在*/
	$2300("2300","货币名称已存在"),
	
	/**该货币利率已配置，请勿重复操作*/
	$2301("2301","该货币利率已配置，请勿重复操作"),
	
	/**暂无数据可以提交*/
	$2302("2302","暂无数据可以提交,只能提交今日数据"),
	
	/**暂未配置资产利率信息*/
	$2303("2303","暂未配置资产利率信息"),
	
	/**资产冻结中，暂时无法操作*/
	$2304("2304","资产冻结中，暂时无法操作"),
	
	
	//################################################2400-2600任务处理###########################

	/**收益已经计算，请勿重复处理*/
	$2400("2400","收益已经计算，请勿重复处理"),
	
	
	//################################################2600-2800lbank处理###########################
	/**用户授权失败*/
	$2600("2600","用户授权失败"),
	
	/**资产划入失败*/
	$2601("2601","资产划入失败"),
	
	/**交易类型错误*/
	$2602("2602","交易类型错误"),
	
	/**资产不足*/
	$2603("2603","资产不足"),
	
	/**数据清算期间无法进行交易*/
	$2604("2604","数据清算期间无法进行交易"),

	/**获取资产信息失败*/
	$2605("2605","获取资产信息失败"),
	
	/**系统繁忙，请稍后重试*/ 
	FAIL("9999","系统繁忙，请稍后重试");


	
	 
	private String code;
	
	private String desc;

	private RspCodeEnum(String code, String desc) {
		this.code = code;
		this.desc = desc;
	}

	public String getCode() {
		return code;
	}

	public void setCode(String code) {
		this.code = code;
	}

	public String getDesc() {
		return desc;
	}

	public void setDesc(String desc) {
		this.desc = desc;
	}
	
	
}
